Repository: giellalt/corpus-nob
Catalog: prestable/tmx/sme/facta/skuvlahistorja6/saraelle-n.html.tmx
Source language: nob
Languages: sme

source: Samisk høgskole – en students erfaring
sme: Artihkal girjjis Sámi skuvlahistorjá 6.

source: Sara Ellen J. Eira Heahttá på Samisk høgskoles kantine.
sme: Sara Ellen J. Eira Heahttá: Sámi allaskuvla-studeantta vásáhusat

source: I bakgrunnen Mathis Bongo, Johan Aslak Siri og Johan Klemet Kalstad.
sme: Duogážis: Mathis Bongo, Johan Aslak Siri, Johan Klemet Kalstad.

source: (Foto: Svein Lund)
sme: (Govva: Svein Lund)

source: Sara Ellen J. Eira Heahttá er født i 1974 og er oppvokst i en reindriftsfamilie i Kautokeino.
sme: Sara Ellen J. Eira Heahttá lea riegádan 1974:s ja bajásšaddan boazodoallobearrašis Guovdageainnus.

source: Der har hun gått grunnskolen og videregående skole.
sme: Doppe son lea vázzán vuođđoskuvlla ja joatkkaskuvlla.

source: Hun var student ved Samisk høgskole i perioden 2001-2007.
sme: Son lei Sámi allaskuvlla studeantan 2001-2007.

source: Her forteller hun om den 4-årige allmennlærerutdanninga.
sme: Dá son muitala 4-jagáš dábálašoahpaheaddjioahpu birra.

source: Etter det har hun studert samisk mellomfag, veiledningspedagogikk og vitenskapelig skriving og utredning.
sme: Dan maŋŋel son lea lohkan sámegiela gaskafága, bagadallanpedagogihka, ja dieđalaš čállima ja guorahallama.

source: Sara Ellen har jobbet ved næringskontoret i Kautokeino kommune, ved studieadministrasjonen på Samisk høgskole og ved Samisk språknemnds administrasjon.
sme: Sara Elle lea bargan Guovdageainnu suohkana ealáhuskantuvrras, Sámi allaskuvlla hálddahusas ja Sámi giellalávdegottis.

source: Siden april 2012 har hun jobbet i Sametinget i Norge, i læremiddelprosjektet Ovttas.
sme: Cuoŋománu 2012 rájes son bargá Sámedikkis, Ovttas- oahpponeavvoprošeavttain.

source: Hun har også jobbet med oversetting mellom norsk og samisk, og bl.a. oversatt noen artikler i Samisk skolehistorie-bøkene.
sme: Son lea maiddái jorgalan dáro- ja sámegiela gaskkas, ee. muhtin artihkkaliid Sámi skuvlahistorjá-girjjiin.

source: Våre egne datamaskiner!
sme: Iežamet dihtorat!

source: Jeg begynte på allmennlærerutdanninga ved Samisk høgskole høsten 2001.
sme: Mun álgen sámi allaskuvlla dábálašoahpaheaddjiohppui čakčat 2001.

source: Første studiedag på høgskolen hadde vi oppmøte på et klasserom de kalte Násti.
sme: Vuosttaš beaivvi go olliimet skuvlii, de čoahkkaneimmet Násti-nammasaš latnjii.

source: Etter at vi hadde fått en del informasjon om skolen og utdanninga, begynte de å rope opp navnene våre.
sme: Go leimmet veaháš dieđuid ožžon skuvlla ja oahpu birra, de álge čuorvut min namaid.

source: Den første de ropte opp, hadde ikke møtt fram.
sme: Vuosttaža gean čurvo ii lean boahtán.

source: Den andre var meg.
sme: Nubbi ledjen mun.

source: Jeg gikk fram og tok i mot en ransel.
sme: Mun mannen ovddageahčai lanja, ja válden vuostá lávkkaža.

source: Oppi der lå en bærbar datamaskin!
sme: Doppe lei askedihtor!

source: Det var min aller første datamaskin.
sme: Dat lei mu vuosttaš dihtormášiidna.

source: Hele klassen fikk hver sin bærbare datamaskin den første studiedagen.
sme: Olles luohkká oaččui vuosttaš skuvlabeaivvi sierra askedihtora!

source: Og med den skrev vi historie ved Samisk høgskole.
sme: Ja nie mii čáliimet historjjá Sámi allaskuvllas!

source: Det at vi fikk vår egen datamaskin, var en del av et prosjekt som Samisk høgskole var med på.
sme: Dat ahte oaččuimet sierra askedihtora, lei oassin prošeavttas mas Sámi allaskuvla lei mielde.

source: Målet var å lære nye lærerstudenter å bruke datamaskin og hvordan man kan bruke datamaskin i grunnskoleundervisninga.
sme: Ulbmilin lei ođđa oahpaheaddjistudeanttaide oahpahit dihtorgeavaheami ja movt dihtor sáhttá adnot vuođđoskuvllas, oahpahusas.

source: Samtidig fikk vi studere læremiddelpedagogikk, der vi brukte mye datamaskin og fikk lære å bruke en rekke forskjellige pedagogiske dataprogrammer.
sme: Seammás oaččuimet lohkat oahpponeavvopedagogihka, mas aniimet hui ollu dihtora ja beasaimet oahppat iešguđetlágan prográmmaid geavahit.

source: Datamaskinen brukte vi ellers når vi skrev oppgaver i de andre fagene, og i forbindelse med praksis.
sme: Dihtora mii aniimet muđui buot čálalaš bargguin buot fágain, ja maiddái hárjehallama oktavuođas.

source: Forskjellige lærere
sme: Máŋggalágán oahpaheaddjit

source: Første året hadde vi bl.a. samisk 1, pedagogikk, både teori og praksis, læremiddelpedagogikk og kristendom med livssynskunnskap.
sme: Vuosttaš jagi lei sámegiella 1, pedagogihka teoriija ja hárjehallan, oahpponeavvopedagogihkka ja risttalašvuohta eallinoaidnodieđuin.

source: I samisk hadde vi blant annet folkediktning og da studerte jeg fortellinger om utbor.
sme: Sámegielas mis lei ee. álbmotdikten ja dalle guorahallen eahpárašmuitalusaid.

source: Ellers lærte vi om samisk fortellingstradisjoner.
sme: Muđui oahpaimet sámi muitalanárbevieruid birra.

source: Det var veldig artig at vi fikk arbeide med samiske temaer og som vi kjente til på forhånd, men samtidig jobbe med disse på en annen måte.
sme: Lei somá go beasaimet dakkár fáttáiguin bargat mat gullet sápmái ja mat midjiide ledje oahppásat ovdalaččas, muhto seammás bargat eará ládje daiguin fáttáiguin.

source: Grammatikk var jo selvfølgelig en del av samisk 1.
sme: Grammatihkka gal dieđusge lei maid oassin sámegiella 1:žis.

source: Andre året i lærerutdanninga hadde vi pedagogikk, duodji 1, matematikk og natur-, samfunns- og miljølære.
sme: Nuppi jagi oahpaheaddjioahpus mis lei pedagogihkkateoriija ja hárjehallan, duodji 1, matematihkka, ja luondu-, servodat- ja birasoahppu.

source: I naturfaget var vi mye ute, bl.a. på skiturer, fisketurer og vi forsket på snøen.
sme: Luonddufágas leimmet olu olgun, ee. čuoiganmátkkiin, guliid bivdime ja muohttaga dutkame.

source: I matematikk hadde vi i hvert fall tre forskjellige lærere som jeg husker og alle foreleste på samisk.
sme: Matematihkas ledje hui iešguđet lágan oahpaheaddjit.

source: Noen lot oss streve hardt, mens en annen sa allerede i første time at han egentlig ikke likte didaktikk i det hele tatt, og laga noen oppgaver på tavla som vi skulle løse.
sme: Muhtumat ražahedje min bures, muhto okta gal dajai álggus, vuosttaš diimmu juo, ahte son gal ii leat goassege liikon dien didaktihkkii, ja ráhkadasttii bargobihtáid távvalii maid mii galggaimet čoavdit.

source: En annen forklarte og forklarte helt til vi forsto alt, og vektla viktigheten av å lære elevene matematikk på samisk fra starten av og ta i bruk samisk fagterminologi i matematikk i undervisninga.
sme: Okta fas čilgii ja čilgii dassážii go ipmirdeimmet buot maid sáhtii ipmirdit ja deattuhii man dehálaš lea álggu rájes ohppiide oahpahit matematihka sámegillii ja geavahit sámegiel fágatearpmaid oahpaheamis.

source: Mikkel Nils Sara foreleste i samfunnsfag, og fortalte om hvordan det var i Sápmi før i tiden.
sme: Mihkkal Niillas Sara lei oahpaheaddjin servodatdiehtagis, ja son muitalii movt sámis lei don dolin.

source: Det var veldig interessant å høre, og han var en veldig flink forteller.
sme: Dat lei hui somá gullat, ja son lei hui čeahpes muitaleaddji.

source: Tredje studieår hadde vi bl.a. samisk 2 og pedagogikk, både teori og praksis.
sme: Goalmmát oahppojagi lei mis ee. sámegiella 2, pedagogihkkateoriija ja hárjehallan.

source: I tillegg studerte jeg urfolks duodji og kunstkunnskap.
sme: Lassin lohken álgoálbmotduoji ja dáiddadieđu.

source: Urfolks duodji og kunstkunnskap var en meget interessant studie og vi fikk besøke mange utstillinger bl.a. i Jokkmokk og Karasjok.
sme: Álgoálbmotduodji ja dáiddadiehtu lei gelddolaš oahppu ja beasaimet olu čájáhusaid oaidnit, ee. Johkamohkis ja Kárášjogas.

source: I dette studiet var Gunvor Guttorm koordinator og hun var flink med å invitere andre urfolkskunstnere og -håndverkere til å forelese for oss.
sme: Dan oahpus lei Gunvor Guttorm koordináhtorin ja son lei čeahppi bovdet eará álgoálbmotduojáriid ja dáiddáriid midjiide logaldallin.

source: Det var et veldig spennende studium.
sme: Dat lei hui somás ja gelddolaš oahppu.

source: Jeg leste også veiledningspedagogikk, og der lærte vi om veiledningsmetoder som var litt annerledes enn i vanlig pedagogikk.
sme: Muđui lohken bagadallanpedagogihka 1:ža mas maid ohppen olu movt earáid sáhttá bagadallat veahá eará ládje go maid dábálaš pedagogihkkafágas ledjen oahppan.

source: Fjerde året studerte jeg norsk og gymnastikk.
sme: Njealját jagi lei mus dárogiella ja lášmmohallan.

source: I gymnastikk hadde vi mye praktiske øvelser både på vinter- og sommerføre, og også om hvordan man kan ha gymnastikkundervisning inne.
sme: Lášmmohallamis lei olu praktihkalaš oahpahus sihke bievla- ja dálvemáilmmis, ja maiddái movt viesus sáhttá lášmmohallat.

source: Svømming hadde vi også.
sme: Vuojadeapmi maid lei.

source: Vi lærte også litt om fotmassasje og øreakupunktur.
sme: Oahpaimet maid veahá juolgevuođđoruvvema birra ja bealje-akupunktuvrra birra.

source: Vi var på overnattingstur og overnattet da i lavvo.
sme: Muđui leimmet idjadanmátkkis meahcis ja idjadeimmet lávuin.

source: Det var veldig artig, for en gruppe hadde funnet på artige leker for oss andre.
sme: Dat lei hui somá, go okta joavku lei hutkan somás stohkosiid midjiide earáide.

source: I norskfaget foregikk all undervisning på norsk, men noen av pensumbøkene var om samisk kultur, og skriftlige innleveringer kunne for eksempel handle om samisk fortellertradisjon.
sme: Dárogiella oahpahuvvui dárogillii, muhto lei dasge oassi sámi kultuvrra birra lohkamuš, ja čállinbargguid sáhtii čállit omd. sámi muitalusárbevieru birra.

source: Vi var så heldige at Mathis Bongo var lærer ved høgskolen. Selv om han ikke hele tiden var vår lærer, så brukte han å hjelpe oss med forskjellige utfordringer.
sme: Mis lei nu lihkku ahte Mathis Bongo lei allaskuvllas oahpaheaddjin, ja vaikko ii lean ge álo min oahpaheaddji, de lávii veahkehallat min feara makkár hástalusaiguin.

source: Det var også han som fikk oss med på forskjellige nyere prosjekter og som velvillig hjalp oss med IKT-greier.
sme: Son lei maid dat gii oččodii min dakkár ođđamállet prošeavttaide mielde, ja gii áŋgirepmosit veahkahalai min DGT (diehtojuohkin- ja gulahallanteknologiija) hommáiguin.

source: Mathis Bongo var lærer i læremiddelpedagogikk. Det er i det faget jeg har lært mest pedagogikk, fordi vi hadde ikke den samme pedagogikk læreren over tid, og da ble det så som så med den vanlige pedagogikkfaget.
sme: Mathis Bongo lei oahpponeavvopedagogihka oahpaheaddji ja mun goit lean dan fágas oahppan buot buoremusat pedagogihka, go mis ii lean dat oktahat pedagogihka oahpaheaddji.

source: I 2005 fikk Samisk høgskole kvalitetsprisen, og det var Mathis Bongo, med litt hjelp fra oss studentene, som forsvarte den prisen.
sme: Sámi allaskuvla oaččui 2005:s kvalitehtabálkkašumi, ja dat gal lei Mathis Bongo ja veahá min studeanttaid ánsu.

source: Kristine Nystad var også vår lærer i læremiddelpedagogikk, og hun var både flittig og tålmodig med oss, og spurte stadig ting vi måtte gruble godt over.
sme: Kristine Nystad lei maid mis oahpponeavvopedagogihkas ja son lei sihke áŋgir ja gierdavaš minguin, ja álohii jearaheame mis dakkáriid mat bidje min jurddahit.

source: Undervisning i duodji
sme: Duodjeoahpahus

source: Duodji var det mest spennende faget, syns jeg, fordi jeg alltid har likt å holde på med duodji.
sme: Duodji lei somámus fága mu mielas, go lean álo liikon duddjot.

source: Der hadde vi også dyktige lærere. Husker spesielt godt Máret Magga, fra finsk side av Sápmi, og Thomas Marainen fra Sverige.
sme: Mis ledje maid hui čeahpes oahpaheaddjit, ee Máret Magga, gii lea Suoma beale sápmelaš, ja Thomas Marainen, Ruoŧa beale sápmelaš.

source: I duodji laga vi en perm hvor vi samla tegninger, duodjibeskrivelser og de duodjiproduktene som fikk plass i permen.
sme: Mii ráhkadeimmet bearpma masa čohkkiimet tevnnegiid, čáliimet duodječilgehusaid ja bargguid mat dohko čáhke.

source: I sløyd laga vi smøreske av tre.
sme: Garraduojis ráhkadeimmet vuodjaskáhpu.

source: Det hadde jeg aldri før laga, og det var veldig artig å lære å lage en sånn eske.
sme: Dan in lean ovdal goassege ráhkadan ja lei hui somá oahppat vuodjaskáhpu duddjot.

source: Vi garva også reinskinn.
sme: Sistti maid divššuimet.

source: Ellers laga vi dukke og sydde klær til den.
sme: Muđui goaruimet dohká ja dasa biktasiid.

source: Min eldste gutt kalte han for Biera.
sme: Mu boarráseamos bárdni navddii dan Bieran.

source: Jeg sydde kommager, skinnbukser, skinnkofte og skinnbelte samt skinnlue til dukken.
sme: Gorron dasa čázehiid, sisttehiid, sistegávtti ja boahkána ja siste-gahpiračča.

source: Deleksamen besto av å forklare hvordan man skulle berede leggskinnene.
sme: Oasseeksámen lei čilget movt galgá meaidit gápmasiid.

source: Hovedeksamenen var en skriftlig eksamen.
sme: Váldoeksámen gal lei čálalaš eksámen.

source: Husker at det var mange små oppgaver vi skulle lage i duodji, men håndarbeid er et tidskrevende arbeid, og jeg undres over at det var bare 15 studiepoeng for så mye arbeid.
sme: Muittán ahte ledje oalle olu smávva barggut, muhto duddjon váldá olu áiggi ja mun goit imaštallen ahte leat go jur dušše vihttanuppelohkái oahppočuoggá nie olu bargguid ektui.

source: I tillegg til håndarbeid var det skriftlige oppgaver og studiereiser.
sme: Earret duddjomii ledje lassin čálalašbarggut ja oahppomátkkit.

source: Natur-, miljø og samfunnsfag var også et interessant fag.
sme: Oahpahus meahcis Luondu-, servodat- ja birasoahppu lei somás fága.

source: Vi hadde mange praktiske oppgaver og jeg husker at vi var på skitur, der nå avdøde Mikkel Isak Oskal forklarte om snø, snøføre og hvordan snøen påvirker reinbeitet.
sme: Das ledje veahá praktihkalaš geahččaleamit ja muittán ahte leimmet čuoiganmátkkis gos Oskal Máhte Mihkkel-Issát rohkki čilgii muohttaga birra ja movt dat váikkuha ealáhahkii.

source: Han hadde så rikt ordforråd og lærte oss forkjellige snøtermer etter hvert som vi lenger ut i naturen.
sme: Son lei hui sátnerikkis ja muitalii midjiide muohtasániid dađistaga dien tuvrras.

source: Vi var også på fisketur, satte ut garn, og målte vannets dybde og sjekket hvor gamle noen av fiskene var.
sme: Muđui leimmet fierbmume, mihtideame jávrri čikŋodaga, ja iskkaimet man boaris guolli lea.

source: Om vinteren smeltet vi nysnø og kornsnøen som ligger nederst mot marka, og målte hva som ga mest vann.
sme: Dálveáiggi mii suddadeimmet ođđa vaza ja seaŋášmuohttaga ja mihtideimmet goabbá addá eambbo čázi.

source: Adopterte hele skolen
sme: Válddiimet olles skuvla badjelasamet

source: Første året var jeg på praksis i Karlebotn skole i Nesseby kommune.
sme: Vuosttaš jagi ledjen hárjehallamis Stuorravuonas, Unjárgga gielddas.

source: Vi var på to praksisperioder det året, en på høsten og en på våren.
sme: Ledje guokte hárjehallama, namalassii čakča- ja giđđahárjehallan.

source: Mine første praksisveiledere var Inger Katrine Juuso og Magnhild Mathisen, og de var både tålmodig og ivrige på å forklare deres arbeid på skolen, tusenvis av planer og skolens rutiner og hvordan de brukte å jobbe med den enkelte fag og oppgaver.
sme: Mu vuosttaš hárjehallanbagadallit leigga Inger Katrine Juuso ja Magnhild Mathisen, ja soai leigga sihke gierdavaččat ja viššalat čilget skuvlabargguid, duháhiid mielde plánaid ja skuvlla vieruid ja dan movt sii lávejit sin skuvllas bargat guđege fágain ja bargguin.

source: Jeg husker at vi i begynnelsen ikke var så sikre på alt det veilederne forklarte oss, men sammen fant vi ut hva vi trengte av informasjon.
sme: Muittán ahte eat lean nu sihkkarat álggus maid bagadalli čilgii midjiide, muhto gal mii ovttas gávnnaheimmet makkár dieđuid mii dárbbaheimmet.

source: Under praksisperioden på våren overtok vi hele Karlebotn skole. Det var en såkalt skoleadopsjon.
sme: Giđđahárjehallamis mii válddiimet badjelasámet olles Stuorravuona skuvlla, lei dakkár nu gohčoduvvon skuvlaadopšuvdna.

source: Praksisen varte i 3-4 uker, og da var de faste lærerne på kurs, tror jeg.
sme: Hárjehallan bisttii 3-4 vahkku ja dan botta ledje skuvlla oahpaheaddjit gurssain.

source: Jeg var bra nervøs i begynnelsen, men det gikk mye bedre enn jeg hadde fryktet.
sme: Ledjen oalle mihá balus álggus, muhto manai mihá buorebut go ledjen oba jáhkkán ge.

source: Jeg undres på hvordan de i det hele tatt turde å overlate hele skolen i hendene på førsteårsstudenter.
sme: Imáštallen gal movt dat oba dustet ge guođđit olles skuvlla vuosttaš jagi studeanttaid háldui.

source: Vi hadde jo vært en uke i Karlebotn tidligere samme skoleår, men da jobbet vi ikke så mye, for vi skulle observere og bli kjent med skolen og elevene.
sme: Mii leimmet gal leamaš vahku juo Stuorravuona skuvllas ovdal juovllaid, muhto dalle eat bargan nu olu, go galggaimet dušše oahpásnuvvat ja geahčadit skuvlla ja ohppiid.

source: Vi hadde laga en film om snarefangst på ryper i læremiddelpedagogikk før vi dro på praksis, og brukte den som utgangspunkt og grunnlag for undervisninga der.
sme: Mii leimmet oahpponeavvopedagogihka fágas ráhkadan filmma rievssatgárduma birra ovdal go vulggiimet hárjehallamii, ja dan aniimet vuođđun min oahpahusas.

source: Elevene der hadde en litt annerledes undervisning de ukene vi var der.
sme: Ohppiin gal lei dieid vahkuid veahá earálágan oahpahus go dábálaččat.

source: I Karlebotn fikk vi bo på internatet.
sme: Stuorravuonas beasaimet orrut internáhtas.

source: Det var litt skummelt fordi vi hadde hørt av studenter som hadde vært der tidligere at de hadde hørt merkelige lyder der på nattestid og at det spøkte der.
sme: Lei gal veahá soaiggus, go ovddit studeanttat ledje muitalan ahte doppe gullojit feara makkár jienat ijaid ja ahte báikkis gopmohallá.

source: Vi fikk i hvert fall bo gratis der og det betydde jo mye for studenter.
sme: Orrun lei goit nuvttá ja studentii han gal dat mearkkašii olu.

source: Og det stedet kommer jeg nok aldri til å glemme.
sme: Ja báikki in dáidde goassege vajálduhttit. Orui nu ávdin.

source: Engang dukket det opp en fremmed båt dit, og selv om vi var midt i et møte akkurat da, så gikk alle bort til vinduet for å se hvem det var som kom dit.
sme: Oktii bođii amas fanas dohko, ja vaikko mis leige čoahkkin juste dalle, de goitge buohkat njuikeje ja vihke lásii geahččat mat dat ges leat olbmuid mat deike bohte.

source: Husker også en morgen når en av mine medstudenter så lenge ut av vinduet, strakte armene mot havet og sa:
sme: Muittán maid bures ovtta iđida go okta mu mielstudeanttain geahčai guhká láseráigge olggos, geigii meara guvlui gieđaid ja dajai: «Gea dá, dá lea máilmmi loahppa!

source: Karlebotn skole i Nesseby
sme: Stuorravuona skuvla Unjárggas

source: Å lage læremidler sammen med elevene
sme: Ráhkadit oahpponeavvu ohppiiguin ovttas

source: Andre studieåret var jeg på praksis i Kautokeino barneskole. Brita Hætta Haglund var da vår praksisveileder og Ole Magnus Triumf og Sylvi Rasmus var mine praksiskamerater.
sme: Nuppi oahppojagi ledjen Guovdageainnu mánáidskuvllas hárjehallamis ja Brita Hætta Haglund lei hárjehallanbagadalli, ja mu hárjehallanolbmát leigga Ole Magnus Triumf ja Sylvi Rasmus.

source: Vi hadde en særdeles fin klasse.
sme: Lei erenoamáš fiinna luohkká.

source: Vi laga sammen med elevene et digitalt læremiddel som vi hadde påbegynt på forhånd.
sme: Mii ráhkadeimmet ovttas ohppiiguin oahpponeavvu masa leimmet ovdal ráhkadan vuođu.

source: Da brukte vi MultimediaLabV dataprogram som vi fylte på med bilder og tekster etter hvert.
sme: Mii aniimet MultimediaLabV-nammasaš dihtorprográmma masa dađistaga lasiheimmet govaid ja teavsttaid.

source: Da kom vi i avisa med overskriften teknologiske studenter.
sme: Dalle beasaimet vel aviisii go leimmet nu teknologalaš studeanttat.

source: Jeg husker godt første gangen vi åpnet datamaskinene i klasserommet.
sme: Muittán vuohččan go rabaimet askedihtora luohkkálanjas.

source: En av elevene sa at på skolen er det ikke lov å bruke data!
sme: Okta oahppi gal de dajai ahte ii skuvllas leat lohpi atnit dihtora!

source: Da forklarte vi at jo, når vi var på praksis der så skal alle jobbe med datamaskin.
sme: Mii čilgiimet ahte juo, go mii leat doppe hárjehallamis de galget buohkat bargat dihtoriin.

source: Det gikk ikke lenge før de skjønte at data kan brukes som et redskap og ikke bare til spilling.
sme: Fargga fuobmáje oahppit ahte dihtora sáhttá atnit reaidun iige dušše «stoahkamii».

source: Vi tok en tur til høgskolens datarom, slik at alle kunne lære seg å søke etter informasjon på internett.
sme: Manaimet maid allaskuvlla dihtorlanjas, vai buohkat besset oahppat ohcat interneahtas dieđuid.

source: Samme året hadde vi et ungdomsskoleprosjekt i Kautokeino.
sme: Seamma oahppojagi lei mis nuoraidskuvlaprošeakta ja leimmet Guovdageainnu nuoraidskuvllas.

source: Ungdomsskolelærerne skulle veilede oss når vi skulle lage læremidler sammen med elevene.
sme: Nuoraidskuvlaoahpaheaddjit galge bagadallat min go ráhkadeimmet oahpponeavvuid.

source: Jeg syns ikke det gikk så bra, for det var altfor mange elever på hver student.
sme: Mu mielas dat ii lihkostuvvan nu bures, go ledje beare olu oahppit guđege studeantta nammii.

source: Ikke alle elevene fikk fotografere og arbeide med bilder, som jo var en del av prosjektet.
sme: Eai buot oahppit beassan geahččaladdat govvet ja govaiguin bargat, mii lei oassin prošeavttas.

source: Også hadde vi så lite tid, bare noen få dager.
sme: Muđui dat bisttii nu oanehaš, dušše moadde beaivvi.

source: Vi fikk ikke tid til det vi skulle og ville gjøre på de dagene.
sme: Eat das ollen gal nu olu go leimmet galgat ja háliidit.

source: Ungdomsskoleprosjekt i Kautokeino
sme: Nuoraidskuvlaprošeakta Guovdageainnus

source: Vi hadde enda et ungdomsskoleprosjekt i Kautokeino, der målet var å lære elevene bruken av informasjons- og kommunikasjonsteknologi (IKT).
sme: Mis lei vel nubbi nuoraidskuvlaprošeakta Guovdageainnus, mas ulbmilin lei oahpahit ohppiide diehtojuohkin- ja gulahallanteknologiija (DGT).

source: Elevene skulle ha yrkesorientering og bli kjent med IKT, og etterpå skulle de fremføre det hver enkel gruppe hadde lært.
sme: Oahppit galge oahpásnuvvat bargodillái (fidnobagadallan) ja seammás DGT:ii ja maŋŋel ovdanbuktit eará ohppiide dan maid guhtege joavku lei oahppan.

source: Husker at vår gruppe ville bli kjent med reindrifta, og de var veldig ivrige med å intervjue folk og dra ut får å se hvordan det var å jobbe innen reindrifta.
sme: Muittán ahte min joavku áiggui oahpásnuvvat boazodollui ja ledje hui áŋgirat jearahallat ja mannat geahččame movt boazodilis lea bargat.

source: Vi var en tur i Heammogieddi, og fikk kjøre med rein der, og elevene fikk oppleve hvordan man kunne skaffe ekstrainntekter i reindrifta.
sme: Manaimet maid Heammogiettis herggiiguin vuodjime, ja oahppit bessege oaidnit movt boazodoalus sáhttá háhkat lassidietnasa.

source: De lærte at de kunne temme oksereinene og tilby kjøreturer for turister, barnehager og skoler.
sme: Sii ohppe ahte sáhttá herggiid dápmat ja vuovdit turisttaide, mánáidgárddiide ja skuvllaide heargevuodjinmátkkiid.

source: Elevene fikk låne digitalkamera og lydopptakere og de jobba veldig bra i fritiden.
sme: Oahppit ožžo luoikat digitála govvenapparáhtaid ja báddenrusttegiid ja barge hui buori barggu friddjaáiggis.

source: Fremføringa gikk også bra, selv om veldig få foreldre var kommet, og vi plagdes litt med teknikken i begynnelsen.
sme: Ovdanbuktin manai maid hui bures, vaikko ledje hui unnán váhnemat boahtán, ja veahá bártideimmet teknihkain álggus.

source: Jeg var blitt så vant med å bruke det programmet at jeg holdt kurs for andre studenter om bruken av dette programmet.
sme: Dienge prošeavttas barggaimet MultimediaLabV-prográmmain ja ledjen nu hárjánan dainna bargat ahte dollen kurssa eará studeanttaide dien prográmmas.
